<policy>
    <!-- General - Name, Enabled/Disabled, Triggers, Frequency, Categories -->
    <general>
        <name>%POLICY_NAME%</name>
        <enabled>true</enabled>
        <trigger_other>latest-%NAME%</trigger_other>
        <frequency>Ongoing</frequency>
        <category>
            <name>%POLICY_CATEGORY%</name>
        </category>
    </general>
    <!-- Scope -->
    <scope>
        <all_computers>false</all_computers>
        <computer_groups>
            <computer_group>
                <name>%GROUP_NAME%</name>
            </computer_group>
        </computer_groups>
        <exclusions/>
    </scope>
    <!-- Packages -->
    <package_configuration>
        <packages>
            <size>1</size>
            <package>
                <name>%pkg_name%</name>
                <action>Install</action>
            </package>
        </packages>
    </package_configuration>
    <!-- Scripts -->
    <scripts>
        <size>0</size>
    </scripts>
    <!-- Self Service details -->
    <self_service>
        <use_for_self_service>true</use_for_self_service>
        <install_button_text>Install %version%</install_button_text>
        <reinstall_button_text>Reinstall %version%</reinstall_button_text>
        <self_service_display_name>%NAME%</self_service_display_name>
        <self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
    </self_service>
    <!-- Maintenance e.g. recon -->
    <maintenance>
        <recon>true</recon>
    </maintenance>
    <!-- Files and processes e.g. run command -->
    <files_processes/>
    <!-- User interaction e.g. start and finish messages -->
    <user_interaction>
        <message_start/>
        <message_finish/>
    </user_interaction>
</policy>
